# 1-100 
x=c(1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100)
# 生成 y 11-110 
y=c(11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110)

# 计算x的平方 + x除以y＋y+3 的结果
result = x^2 + x/y+10*y+3
# print(result)

# x=1:100
# y=11:110

# # print(length(x))
# # print(length(y))

# result = x^2 + x/y+10*y+3
# print(result)


# log
# sin
# print(cos(pi/2))
# print(sin(pi/2))
# print(tan(pi/4))
# print(log(10))
# print(exp(1))
# print(sqrt(2))
# print(abs(-10))
# print(round(3.1415926,2))
# print(ceiling(3.1415926))
# print(floor(3.1415926))
# print(sign(3.1415926))
# print(sign(-3.1415926))
# print(asin(1))
# print(acos(1))


# x1 = 100:200
# x2 = 1:6
# print(x1+x2)


x =1:5
y = 2*1:5

# print(x%*%y) # 内积

# 外积

# print(prod(1:8))

# 矩阵的四则运算
# A = matrix(1:16,4)
# B = matrix(1:4,2)
# print(A%*%B) # 矩阵乘法
# print(t(A)) # 转置
# print(A+B) # 加法
# print(A-B) # 减法
# print(A*B) # 乘法
# print(A/B) # 除法
# print(A^2) # 幂运算
# print(A%/%B) # 整除运算
# print(A%%B) # 余数运算
# print(A<B) # 比较运算
# print(A==B) # 逻辑运算

A = matrix(1,2,3,4);
x =  matrix(1,3) ;
print(A%*%x)

print(diag(c(1,2,3))) # 对角矩阵